public class Task8 {
    public static void main(String[] args) {
        System.out.println("Привет!");
        int z = 2147483647 + 1;
        System.out.println(z);
        //Переменная типа int содержит 32 бита и может принимать 4,294,967,296 значений.
        //Половину этого диапазона отдали под отрицательные числа, а вторую — под положительные.
        // Следовательно получен диапазон значений от -2,147,483,648 до 2,147,483,647.
        // Полученное число z больше максимально возможного значения типа int, поэтому количесвтво бит, которые не вместились в память, урезаются.
    }
}
